import java.util.*;
import java.io.*;

// 17070 : 파이프 옮기기
/*
-- 전제조건
1. 유현이가 새 집으로 이사했다.
2. 새 집의 크기는 n * n 의 격자판으로 나타낼 수 있다
3. 집 수리를 위해서 파이프 하나를 옮기려고 하는데 파이프는 회전 시킬 수 있으며 , 3가지의 방향이 존재한다.
4. 파이프는 항상 빈칸만 차지해야한다. 그리고 파이프를 밀 수 있는 방향은 총 3가지 밖에 없다.
5. 오른쪽 , 우하 방향 , 아래 방향이다 , 파이프는 밀면서 회전 시킬 수 있는데 회전은 45도만 시킬 수 있으며 , 미는 방향은 앞서 말한 방향이다.
6. 파이프가 가로로 놓여진 경우에 가능한 이동방법은 오른쪽 , 우하 , 그리고 대각으로 가는 경우에는 무려 3방향이 비어있어야한다.
7. 그리고 가로 , 세로로 놓여져 있는 경우에는 이동 방법이 2가지이지만 , 대각으로 놓여져있을 떄에는 무려 방법이 3개나 존재한다.
8. 가장 처음에 파이프는 (1, 1)과 (1, 2)를 차지하고 있고 , 방향은 가로이다 , 파이프의 한쪽 끝을 (N, N)으로 이동시키는 방법의 개수를 구해보자.
9. 빈칸은 0 , 벽은 1로 주어진다. (총 방법의 수를 구한다라는 것을 잊으면 x)
-- 틀 설계
1.
 */
public class Main {
    public static void main(String[] args) throws IOException{
        BufferedReader input = new BufferedReader(new InputStreamReader(System.in));
        StringTokenizer st;

    }
}
